# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

import math

# std1 = int(input("Введите количество учащихся в первом классе: "))
# std2 = int(input("Введите количество учащихся во втором классе: "))
# std3 = int(input("Введите количество учащихся в третьем классе: "))

# print(
#     f"Наименьшее число парт {math.ceil(std1 / 2) + math.ceil(std2 / 2) + math.ceil(std3 / 2)}")










